src/cf/InformationRegisters/уатОчередьУведомлений_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатОчередьУведомлений_уэ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаУстановкиСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УбытиеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначенныеМаршрутныеЛисты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUIDСтрокиМЛ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПакетСопроводительныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатТендер_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАктПриемки_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПотребностьВПеревозке_уэ</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАктОтгрузки_уэ</v8:Type>
						<v8:Type>cfg:CatalogRef.уатСопроводительныеДокументы</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказПеревозчику_уэ</v8:Type>
						<v8:Type>cfg:DocumentRef.уатУстановкаСтатусовСопроводительныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСтраховойСертификат_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоФормированияУведомлений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПравилаФормированияУведомлений_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатТипыСобытийДляУведомления_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыСобытийДляУведомления_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаИзМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакреплениеМаршрутногоЛистаЗаПеревозчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВесообъемныхХарактеристик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПунктовМаршрута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаГрузовогоМеста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаОтветаПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаПолучения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаРодительскогоЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибытиеВПунктПланИзменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибытиеВПунктФактИзменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрогнозОпозданияПоМаршрутномуЛисту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасхожденияПоСкладскомуАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбытиеИзПунктаПланИзменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УбытиеИзПунктаФактИзменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеПеревозчикуПоСопроводительнымДокументам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеПеревозчиковНаМаршрутныеЛисты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВодителемСледующегоПункта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатДетализацияЗаказаГрузоотправителя_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатДетализацияЗаказаГрузоотправителя_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрузовымМестам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТоварам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/уатОчередьУведомлений_уэ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Запись.Шаблон) Тогда
		Запись.Шаблон = Запись.ПравилоФормированияУведомлений.ШаблонСообщения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Шаблон)
		И (Не ЗначениеЗаполнено(Запись.ТекстСообщения)
		Или (Запись.ПравилоФормированияУведомлений.ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо 
		И Не ЗначениеЗаполнено(Запись.ТемаПисьма))) Тогда
		
		ПараметрыСообщения = Новый Структура("ДополнительныйДокумент, GUIDСтрокиМЛ, ДатаУстановкиСтатуса, СтатусДокумента,
			|УбытиеПлан, ГрузовоеМесто, НазначенныеМаршрутныеЛисты");
		ЗаполнитьЗначенияСвойств(ПараметрыСообщения, Запись);
		
		Если Запись.ПравилоФормированияУведомлений.ТипСобытия = Перечисления.уатТипыСобытийДляУведомления_уэ.НазначениеПеревозчиковНаМаршрутныеЛисты Тогда
			МенеджерЗаписи = РеквизитФормыВЗначение("Запись");
			ПараметрыСообщения.НазначенныеМаршрутныеЛисты = МенеджерЗаписи.НазначенныеМаршрутныеЛисты;
		КонецЕсли;
		
		Сообщение = ШаблоныСообщений.СформироватьСообщение(
			Запись.Шаблон,
			Запись.Документ,
			Новый УникальныйИдентификатор,
			ПараметрыСообщения);
		Если Не ЗначениеЗаполнено(Запись.ТекстСообщения) Тогда
			Запись.ТекстСообщения = Сообщение.Текст;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.ТемаПисьма) Тогда
			Запись.ТемаПисьма = Сообщение.Тема;
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
	// Для электронных писем определяем, обычным они текстом или HTML.
	ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	Если Запись.ПравилоФормированияУведомлений.ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо или Запись.ПравилоФормированияУведомлений.ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ОформлениеКомплектаДокументов Тогда
		ЭтоПисьмоHTML = СтрНачинаетсяС(Запись.ТекстСообщения, "<!DOCTYPE html") ИЛИ СтрНачинаетсяС(Запись.ТекстСообщения, "<html");
		Если ЭтоПисьмоHTML Тогда
			ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ВложенияФорматированныйДокумент = Новый Структура;
			//ТелоСообщенияОбычныйТекстВHTML = СтрЗаменить(Запись.ТекстСообщения, Символы.ПС, "<br>");
			ТелоСообщенияОбычныйТекстВHTML = Запись.ТекстСообщения;
			ТекстПисьмаФорматированныйДокумент.УстановитьHTML(ТелоСообщенияОбычныйТекстВHTML, ВложенияФорматированныйДокумент);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ТипТекстаПисьма = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") Тогда
		ВложенияФорматированныйДокумент = Новый Структура;
		ТекстПисьмаФорматированныйДокумент.ПолучитьHTML(Запись.ТекстСообщения, ВложенияФорматированныйДокумент);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьСообщение(Команда)
	ЭтаФорма.Записать();
	СформироватьСообщениеНаСервере();
	ЭтаФорма.Закрыть();
	Оповестить("ОбновитьОчередьУведомлений");
КонецПроцедуры

&НаСервере
Процедура СформироватьСообщениеНаСервере()
	УведомлениеМенеджерЗаписи = РеквизитФормыВЗначение("Запись");
	УведомлениеМенеджерЗаписи.Прочитать();
	уатОбщегоНазначения_уэ.ОбработатьУведомление(УведомлениеМенеджерЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронноеПисьмоОбычныйТекст(Команда)
	УстановитьЭлектронноеПисьмоОбычныйТекст(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронноеПисьмоHTML(Команда)
	УстановитьЭлектронноеПисьмоHTML(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПравилоФормированияУведомленийПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ВидУведомления = Запись.ПравилоФормированияУведомлений.ВидУведомления;
	
	флЗаказНаТС           = ТипЗнч(Запись.Документ) = Тип("ДокументСсылка.уатЗаказГрузоотправителя");
	флМаршрутныйЛист      = ТипЗнч(Запись.Документ) = Тип("ДокументСсылка.уатМаршрутныйЛист");
	флЭлектронноеПисьмо   = ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ЭлектронноеПисьмо;
	флОформлениеКомплекта = ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ОформлениеКомплектаДокументов;
	
	Элементы.СтатусДокумента.Видимость = флЗаказНаТС;
	Элементы.ДатаУстановкиСтатуса.Видимость = флЗаказНаТС;
	Элементы.ГрузовоеМесто.Видимость = флЗаказНаТС
		И Запись.Документ.ДетализацияЗакрытия = Перечисления.уатДетализацияЗаказаГрузоотправителя_уэ.ПоГрузовымМестам;
	Элементы.GUIDСтрокиМЛ.Видимость = ТипЗнч(Запись.Документ) = Тип("ДокументСсылка.уатМаршрутныйЛист");
	Элементы.ДополнительныйДокумент.Видимость = флЗаказНаТС Или флМаршрутныйЛист;
	
	Элементы.ТемаПисьма.Видимость = флЭлектронноеПисьмо;
	Элементы.ФормаВидТекстаЭлектронногоПисьма.Доступность = флЭлектронноеПисьмо;
	
	Если ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML Тогда
		Элементы.ФормаВидТекстаЭлектронногоПисьма.Заголовок = "HTML";
		Элементы.ФормаЭлектронноеПисьмоОбычныйТекст.Пометка = Ложь;
		Элементы.ФормаЭлектронноеПисьмоHTML.Пометка = Истина;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СообщениеТекстHTML;
		Элементы.СообщениеОбычныйТекст.Видимость = Ложь;
		Элементы.СообщениеТекстHTML.Видимость = Истина;
	Иначе
		Элементы.ФормаВидТекстаЭлектронногоПисьма.Заголовок = НСтр("ru='Обычный текст';en='Normal text'");
		Элементы.ФормаЭлектронноеПисьмоОбычныйТекст.Пометка = Истина;
		Элементы.ФормаЭлектронноеПисьмоHTML.Пометка = Ложь;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СообщениеОбычныйТекст;
		Элементы.СообщениеОбычныйТекст.Видимость = Истина;
		Элементы.СообщениеТекстHTML.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Шаблон.АвтоОтметкаНезаполненного     = Не флОформлениеКомплекта;
	Элементы.Шаблон.ОтметкаНезаполненного         = Не флОформлениеКомплекта И Не ЗначениеЗаполнено(Запись.Шаблон);
	Элементы.Получатель.АвтоОтметкаНезаполненного = Не флОформлениеКомплекта;
	Элементы.Получатель.ОтметкаНезаполненного     = Не флОформлениеКомплекта И Не ЗначениеЗаполнено(Запись.Получатель);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлектронноеПисьмоHTML(ТребуетсяПереносТекста = Ложь)
	
	ТипТекстаПисьма = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML");
	УстановитьВидимостьДоступность();
	
	Если ТребуетсяПереносТекста Тогда
		ВложенияФорматированныйДокумент = Новый Структура;
		ТелоСообщенияОбычныйТекстВHTML = СтрЗаменить(Запись.ТекстСообщения, Символы.ПС, "<br>");
		ТекстПисьмаФорматированныйДокумент.УстановитьHTML(ТелоСообщенияОбычныйТекстВHTML, ВложенияФорматированныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлектронноеПисьмоОбычныйТекст(ТребуетсяПереносТекста = Ложь)
	
	ТипТекстаПисьма = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст");
	УстановитьВидимостьДоступность();
	
	Если ТребуетсяПереносТекста Тогда
		Запись.ТекстСообщения = ТекстПисьмаФорматированныйДокумент.ПолучитьТекст();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ВидУведомления = Запись.ПравилоФормированияУведомлений.ВидУведомления;
	флОформлениеКомплекта = ВидУведомления = Справочники.уатСпособыВзаимодействий_уэ.ОформлениеКомплектаДокументов;
	
	Если Не флОформлениеКомплекта Тогда
		ПроверяемыеРеквизиты.Добавить("Запись.Получатель");
		ПроверяемыеРеквизиты.Добавить("Запись.Шаблон");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
